<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","backend":"cc77eeb8c27f8cb7fe4903d09b0d37995720f087627598635e4221714f24ff0a","plan_job_ref":"Job Create terraform plan #3 at https://github.com/securing-the-speed/github-configuration/actions/runs/10050040788","plan_hash":"fca2eef64546372494d267572bbfd8860c4161f5d40edfc207657f467bc2f146","plan_text_format":"diff","version":"1.43.0","plan_out_hash":"797e8a3f6af4a2924c7bc49008baa792d9d2192f146781dc5b0f31c3bee1bd85"} -->
Terraform plan in __.__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.organization.github_organization_settings.settings[0] will be created
+   resource "github_organization_settings" "settings" {
+       advanced_security_enabled_for_new_repositories               = false
+       billing_email                                                = "andrewkrug@gmail.com"
+       blog                                                         = "https://resilientsecurity.cloud"
+       company                                                      = "Resilient Security"
+       default_repository_permission                                = "read"
+       dependabot_alerts_enabled_for_new_repositories               = false
+       dependabot_security_updates_enabled_for_new_repositories     = false
+       dependency_graph_enabled_for_new_repositories                = false
+       description                                                  = "This organization is a reference example for the securing the speed course."
+       email                                                        = "andrewkrug@gmail.com"
+       has_organization_projects                                    = true
+       has_repository_projects                                      = true
+       id                                                           = (known after apply)
+       location                                                     = "USA"
+       members_can_create_internal_repositories                     = false
+       members_can_create_pages                                     = false
+       members_can_create_private_pages                             = false
+       members_can_create_private_repositories                      = false
+       members_can_create_public_pages                              = false
+       members_can_create_public_repositories                       = false
+       members_can_create_repositories                              = false
+       members_can_fork_private_repositories                        = false
+       name                                                         = "Securing the Speed Demo Org"
+       secret_scanning_enabled_for_new_repositories                 = false
+       secret_scanning_push_protection_enabled_for_new_repositories = false
+       web_commit_signoff_required                                  = false
    }

  # module.organization.github_team.all[0] will be created
+   resource "github_team" "all" {
+       create_default_maintainer = false
+       description               = "This teams contains all members of our organization."
+       etag                      = (known after apply)
+       id                        = (known after apply)
+       members_count             = (known after apply)
+       name                      = "all_staff"
+       node_id                   = (known after apply)
+       parent_team_read_id       = (known after apply)
+       parent_team_read_slug     = (known after apply)
+       privacy                   = "secret"
+       slug                      = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Create terraform plan #3](https://github.com/securing-the-speed/github-configuration/actions/runs/10050040788)